Autodesk.Revit.UI.DockablePaneState.SetFloatingRectangle(Autodesk.Revit.DB.Rectangle)
When %dockPosition% is Floating, sets the rectangle used to determine the size and position of the pane when %dockPosition% is Floating.  Coordinates are relative to the upper-left-hand corner of the main Revit window.
rect:
The rectangle to use when floating.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Rectangle is not normalized.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014